package com.sinochem.crude.trade.member.contact;

/**
 * Created by wgp on 2018/7/27.
 */
public class UdbCodeConstant {

    public final static Integer SUCCESS=0;
    public final static String CREDENTIALS = "enterprise_type";
//
//    1001,"缺少参数/参数为空",
//            1002,"手机号已被使用",
//            1003,"手机号未被使用",
//            1004,"邮箱已被使用",
//            1005,"邮箱未被使用",
//            1006,"登录名已被使用",
//            1007,"登录名未被使用",
//            1008,"手机号验证未通过",
//            1009,"邮箱验证未通过",
//            1010,"身份证号验证未通过",
//
//            1011,"账户不存在或密码错误",
//            1012,"通过约定解密方式，进行解密失败",
//            1013,"修改密码失败，原始密码输入有误",
//
//            1014,"参数验证未通过",
//            1015,"军官证验证未通过",
//            1016,"护照验证未通过",
//            1017,"添加失败，个人信息已存在",
//            1018, "数据为空或参数错误",
//            1019, "站点未匹配，请输入正确站点标识",
//            1020, "修改的数据不存在",
//            1021, "企业已存在",
//            1022,"添加失败，该企业会员信息已存在",
//            1023,"添加失败，已存在该会员拒绝添加的记录",
//            1024,"添加失败，已添加过未确认",
//            1025,"添加失败，已添加过未确认",
//            1026, "企业资质已存在该类别",
//            1027,"账户不存在",
//            1028,"企业不存在",
//            1029,"证件类型未指定",
//            1030, "企业资质类别不存在",
//            1031,"手机/邮箱/登录名对应多个账户",
//            1032,"添加失败，openId已存在",
//
///**
// * 301-400 数据库操作
// */
//            1301,"查询操作失败",
//            1302,"插入记录操作失败",
//            1303,"更新记录操作失败",
//            1304,"删除记录操作失败",
//
//
//
///**
// * 1500-1600 第三方操作错误码
// */
//            1501,"OSS回调失败",
//
//            9996,"不支持的content-type类型",
//            9997,"缺少签名参数",
//            9998,"验签失败",
//
///**
// * 服务器异常
// */
//            9999,"服务器异常",
}
